{
  "timestamp": "2025-07-24T13:16:35.216135",
  "user_data": {
    "age": 32,
    "weight": 68.0,
    "height": 162.0,
    "gender": "Female",
    "has_children": "Pregnant",
    "sleep_quality": "Sometimes",
    "stress_level": "Less than half the time",
    "mood_level": "Sometimes",
    "activity_level": "Very low (mostly sitting or lying down)",
    "sugar_intake": "Never",
    "water_intake": "7-8 glasses (1400-1600 ml)",
    "smoking_status": "No",
    "supplement_usage": "Yes"
  },
  "recommendation_message": "🇺🇸 Poyraz, thanks so much for sharing all your health information—this really helps me support you in the best way possible! Looking over everything, I see you’re doing great in many areas, but I do have a few personalized suggestions that can support your overall wellness, especially while you’re pregnant.\n\n1. Since your activity level is quite low, gentle daily movement such as short walks or simple stretching (as approved by your doctor) can really help your mood, energy, and overall health—especially during pregnancy.\n2. It’s important to have regular health check-ups while expecting, so be sure to keep up with your prenatal appointments and routine screenings.\n3. Keep taking your supplements, as recommended for pregnancy, to support both your own needs and your baby’s development.\n4. Finally, since your BMI is slightly above the healthy range, consider tracking your weight regularly with your healthcare provider. This ensures both your health and your baby’s are on track.\n\nRemember, small and steady steps matter most. If you ever want to talk about any of these recommendations or need help fitting them into your routine, I’m here for you!\n🇹🇷 Poyraz, tüm sağlık bilgilerinizi paylaştığınız için çok teşekkür ederim—sizin için en uygun önerileri yapabilmem açısından bu gerçekten çok değerli. Mevcut durumda pek çok noktada oldukça iyi gidiyorsunuz, ancak özellikle hamileliğiniz sürecinde faydalı olabilecek bazı önerilerim var.\n\n1. Günlük hareket düzeyiniz düşük olduğu için, doktorunuzun da onayladığı şekilde kısa yürüyüşler veya basit esneme hareketleri eklemek hem ruh halinize hem de enerjinize çok olumlu yansıyacaktır.\n2. Gebelik döneminde düzenli kontrollerinizi ihmal etmemeniz çok önemli. Sağlık kontrollerinizi ve taramalarınızı aksatmadan yaptırmaya devam edin.\n3. Kullanmakta olduğunuz vitamin ve takviyeleri, doktorunuzun önerdiği şekilde almaya özen gösterin. Hem kendi sağlığınız hem de bebeğinizin gelişimi için faydalı olacaktır.\n4. BMI değeriniz hafifçe yüksek olduğu için, kilo takibini düzenli olarak yapmakta fayda var—tabii bunu doktorunuzla birlikte takip etmeniz en doğrusu olur.\n\nUnutmayın, önemli olan küçük ve sürdürülebilir adımlar atmak. Bu önerilerden herhangi birini günlük hayatınıza nasıl dahil edebileceğinizi konuşmak isterseniz her zaman buradayım.",
  "top_4_actions": [
    "movement_break",
    "regular_checkup",
    "take_vitamins",
    "weight_tracking"
  ]
}