{
  "timestamp": "2025-07-21T20:44:49.514414",
  "user_data": {
    "age": 28,
    "weight": 78.0,
    "height": 185.0,
    "gender": "Female",
    "has_children": "Yes",
    "sleep_quality": "Never",
    "stress_level": "Sometimes",
    "mood_level": "Less than half the time",
    "activity_level": "Low (short walks, occasionally standing)",
    "sugar_intake": "3-4 days",
    "water_intake": "3-4 glasses (600-800 ml)",
    "smoking_status": "3-4 cigarettes per day",
    "supplement_usage": "Yes"
  },
  "recommendation_message": "English: Poyraz, thank you so much for sharing all these details with me—your openness makes a real difference! Looking over everything, there are a few key steps you can take for a big boost in your daily wellness.\n\nFirst, I recommend prioritizing regular health checkups—these help you catch potential issues early and stay on track with your wellbeing. Since you currently smoke, even if it's just a few cigarettes a day, cutting back or quitting will hugely benefit your long-term health. Your sleep quality and water intake could use some attention as well. Creating a calming \"screen curfew\" (avoiding screens at least an hour before bed) could help improve your sleep, and increasing your daily water intake will support both your energy and overall health. \n\nThese small steps can make a meaningful change. If you ever need more guidance, I’m always here for you!\nTurkish: Poyraz, tüm bu bilgileri paylaştığınız için çok teşekkür ederim—samimiyetiniz gerçekten çok değerli! Durumunuza baktığımda, günlük hayatınızı rahatlatacak ve sağlığınızı artıracak birkaç önemli adım öne çıkıyor.\n\nÖncelikle, düzenli sağlık kontrollerinizi ihmal etmemenizi öneririm; bu kontroller sayesinde olası sorunları erken yakalayabilirsiniz. Sigara içiyor olmanız uzun vadede sağlığınızı olumsuz etkileyebilir; bırakmayı ya da azaltmayı düşünmek sizin için çok büyük bir katkı sağlar. Uykusuzluk çekiyorsunuz ve ekran başında zaman geçirmek uyku kalitenizi bozabilir. Yatmadan en az bir saat önce ekranlardan uzaklaşmaya çalışmak daha iyi bir uyku düzeni sağlayabilir. Su tüketiminizi artırmak da hem enerjinizi hem genel sağlığınızı olumlu etkiler.\n\nBunların hepsi uygulanabilir küçük ama güçlü adımlar. Sormak istediğiniz bir şey olursa her zaman buradayım!",
  "top_4_actions": [
    "regular_checkup",
    "quit_smoking",
    "screen_curfew",
    "drink_water"
  ]
}